[{"cve_id":"CVE-2016-8279","cwe_id":"284","summary":"The video driver in Huawei Mate S smartphones with software CRR-TL00 before CRR-TL00C01B362, CRR-UL20 before CRR-UL20C00B362, CRR-CL00 before CRR-CL00C92B362, and CRR-CL20 before CRR-CL20C92B362; P8 smartphones with software GRA-TL00 before GRA-TL00C01B366, GRA-UL00 before GRA-UL00C00B366, GRA-UL10 before GRA-UL10C00B366, and GRA-CL00 before GRA-CL00C92B366; and Honor 6 and Honor 6 Plus smartphones with software before 6.9.16 allows attackers to cause a denial of service (device reboot) via a crafted application.","cvss_score":"7.1","exploit_count":"0","publish_date":"2016-09-26","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-8279\/"},{"cve_id":"CVE-2016-7568","cwe_id":"190","summary":"Integer overflow in the gdImageWebpCtx function in gd_webp.c in the GD Graphics Library (aka libgd) through 2.2.3, as used in PHP through 7.0.11, allows remote attackers to cause a denial of service (heap-based buffer overflow) or possibly have unspecified other impact via crafted imagewebp and imagedestroy calls.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-28","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7568\/"},{"cve_id":"CVE-2016-7549","cwe_id":"0","summary":"Google Chrome before 53.0.2785.113 does not ensure that the recipient of a certain IPC message is a valid RenderFrame or RenderWidget, which allows remote attackers to cause a denial of service (invalid pointer dereference and application crash) or possibly have unspecified other impact by leveraging access to a renderer process, related to render_frame_host_impl.cc and render_widget_host_impl.cc, as demonstrated by a Password Manager message.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-25","update_date":"2016-09-27","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7549\/"},{"cve_id":"CVE-2016-7498","cwe_id":"399","summary":"OpenStack Compute (nova) 13.0.0 does not properly delete instances from compute nodes, which allows remote authenticated users to cause a denial of service (disk consumption) by deleting instances while in the resize state.  NOTE: this vulnerability exists because of a CVE-2015-3280 regression.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-27","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7498\/"},{"cve_id":"CVE-2016-7444","cwe_id":"264","summary":"The gnutls_ocsp_resp_check_crt function in lib\/x509\/ocsp.c in GnuTLS before 3.4.15 and 3.5.x before 3.5.4 does not verify the serial length of an OCSP response, which might allow remote attackers to bypass an intended certificate validation mechanism via vectors involving trailing bytes left by gnutls_malloc.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-27","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7444\/"},{"cve_id":"CVE-2016-7420","cwe_id":"200","summary":"Crypto++ (aka cryptopp) through 5.6.4 does not document the requirement for a compile-time NDEBUG definition disabling the many assert calls that are unintended in production use, which might allow context-dependent attackers to obtain sensitive information by leveraging access to process memory after an assertion failure, as demonstrated by reading a core dump.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-16","update_date":"2016-09-16","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7420\/"},{"cve_id":"CVE-2016-7419","cwe_id":"79","summary":"Cross-site scripting (XSS) vulnerability in share.js in the gallery application in ownCloud Server before 9.0.4 and Nextcloud Server before 9.0.52 allows remote authenticated users to inject arbitrary web script or HTML via a crafted directory name.","cvss_score":"3.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7419\/"},{"cve_id":"CVE-2016-7418","cwe_id":"119","summary":"The php_wddx_push_element function in ext\/wddx\/wddx.c in PHP before 5.6.26 and 7.x before 7.0.11 allows remote attackers to cause a denial of service (invalid pointer access and out-of-bounds read) or possibly have unspecified other impact via an incorrect boolean element in a wddxPacket XML document, leading to mishandling in a wddx_deserialize call.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7418\/"},{"cve_id":"CVE-2016-7417","cwe_id":"20","summary":"ext\/spl\/spl_array.c in PHP before 5.6.26 and 7.x before 7.0.11 proceeds with SplArray unserialization without validating a return value and data type, which allows remote attackers to cause a denial of service or possibly have unspecified other impact via crafted serialized data.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7417\/"},{"cve_id":"CVE-2016-7416","cwe_id":"119","summary":"ext\/intl\/msgformat\/msgformat_format.c in PHP before 5.6.26 and 7.x before 7.0.11 does not properly restrict the locale length provided to the Locale class in the ICU library, which allows remote attackers to cause a denial of service (application crash) or possibly have unspecified other impact via a MessageFormatter::formatMessage call with a long first argument.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7416\/"},{"cve_id":"CVE-2016-7415","cwe_id":"119","summary":"Stack-based buffer overflow in the Locale class in common\/locid.cpp in International Components for Unicode (ICU) through 57.1 for C\/C++ allows remote attackers to cause a denial of service (application crash) or possibly have unspecified other impact via a long locale string.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7415\/"},{"cve_id":"CVE-2016-7414","cwe_id":"119","summary":"The ZIP signature-verification feature in PHP before 5.6.26 and 7.x before 7.0.11 does not ensure that the uncompressed_filesize field is large enough, which allows remote attackers to cause a denial of service (out-of-bounds memory access) or possibly have unspecified other impact via a crafted PHAR archive, related to ext\/phar\/util.c and ext\/phar\/zip.c.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7414\/"},{"cve_id":"CVE-2016-7413","cwe_id":"416","summary":"Use-after-free vulnerability in the wddx_stack_destroy function in ext\/wddx\/wddx.c in PHP before 5.6.26 and 7.x before 7.0.11 allows remote attackers to cause a denial of service or possibly have unspecified other impact via a wddxPacket XML document that lacks an end-tag for a recordset field element, leading to mishandling in a wddx_deserialize call.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7413\/"},{"cve_id":"CVE-2016-7412","cwe_id":"119","summary":"ext\/mysqlnd\/mysqlnd_wireprotocol.c in PHP before 5.6.26 and 7.x before 7.0.11 does not verify that a BIT field has the UNSIGNED_FLAG flag, which allows remote MySQL servers to cause a denial of service (heap-based buffer overflow) or possibly have unspecified other impact via crafted field metadata.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7412\/"},{"cve_id":"CVE-2016-7411","cwe_id":"119","summary":"ext\/standard\/var_unserializer.re in PHP before 5.6.26 mishandles object-deserialization failures, which allows remote attackers to cause a denial of service (memory corruption) or possibly have unspecified other impact via an unserialize call that references a partially constructed object.","cvss_score":"7.5","exploit_count":"0","publish_date":"2016-09-17","update_date":"2016-09-19","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7411\/"},{"cve_id":"CVE-2016-7395","cwe_id":"19","summary":"SkPath.cpp in Skia, as used in Google Chrome before 53.0.2785.89 on Windows and OS X and before 53.0.2785.92 on Linux, does not properly validate the return values of ChopMonoAtY calls, which allows remote attackers to cause a denial of service (uninitialized memory access and application crash) or possibly have unspecified other impact via crafted graphics data.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-11","update_date":"2016-09-12","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7395\/"},{"cve_id":"CVE-2016-7191","cwe_id":"287","summary":"The Microsoft Azure Active Directory Passport (aka Passport-Azure-AD) library 1.x before 1.4.6 and 2.x before 2.0.1 for Node.js does not recognize the validateIssuer setting, which allows remote attackers to bypass authentication via a crafted token.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-28","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7191\/"},{"cve_id":"CVE-2016-7180","cwe_id":"416","summary":"epan\/dissectors\/packet-ipmi-trace.c in the IPMI trace dissector in Wireshark 2.x before 2.0.6 does not properly consider whether a string is constant, which allows remote attackers to cause a denial of service (use-after-free and application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7180\/"},{"cve_id":"CVE-2016-7179","cwe_id":"119","summary":"Stack-based buffer overflow in epan\/dissectors\/packet-catapult-dct2000.c in the Catapult DCT2000 dissector in Wireshark 2.x before 2.0.6 allows remote attackers to cause a denial of service (application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7179\/"},{"cve_id":"CVE-2016-7178","cwe_id":"787","summary":"epan\/dissectors\/packet-umts_fp.c in the UMTS FP dissector in Wireshark 2.x before 2.0.6 does not ensure that memory is allocated for certain data structures, which allows remote attackers to cause a denial of service (invalid write access and application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7178\/"},{"cve_id":"CVE-2016-7177","cwe_id":"119","summary":"epan\/dissectors\/packet-catapult-dct2000.c in the Catapult DCT2000 dissector in Wireshark 2.x before 2.0.6 does not restrict the number of channels, which allows remote attackers to cause a denial of service (buffer over-read and application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-29","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7177\/"},{"cve_id":"CVE-2016-7176","cwe_id":"119","summary":"epan\/dissectors\/packet-h225.c in the H.225 dissector in Wireshark 2.x before 2.0.6 calls snprintf with one of its input buffers as the output buffer, which allows remote attackers to cause a denial of service (copy overlap and application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7176\/"},{"cve_id":"CVE-2016-7175","cwe_id":"125","summary":"epan\/dissectors\/packet-qnet6.c in the QNX6 QNET dissector in Wireshark 2.x before 2.0.6 mishandles MAC address data, which allows remote attackers to cause a denial of service (out-of-bounds read and application crash) via a crafted packet.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-09","update_date":"2016-09-26","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7175\/"},{"cve_id":"CVE-2016-7166","cwe_id":"399","summary":"libarchive before 3.2.0 does not limit the number of recursive decompressions, which allows remote attackers to cause a denial of service (memory consumption and application crash) via a crafted gzip file.","cvss_score":"4.3","exploit_count":"0","publish_date":"2016-09-21","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7166\/"},{"cve_id":"CVE-2016-7163","cwe_id":"125","summary":"Integer overflow in the opj_pi_create_decode function in pi.c in OpenJPEG allows remote attackers to execute arbitrary code via a crafted JP2 file, which triggers an out-of-bounds read or write.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-21","update_date":"2016-09-21","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7163\/"},{"cve_id":"CVE-2016-7162","cwe_id":"20","summary":"The _g_file_remove_directory function in file-utils.c in File Roller 3.5.4 through 3.20.2 allows remote attackers to delete arbitrary files via a symlink attack on a folder in an archive.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-26","update_date":"2016-09-28","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7162\/"},{"cve_id":"CVE-2016-7154","cwe_id":"416","summary":"Use-after-free vulnerability in the FIFO event channel code in Xen 4.4.x allows local guest OS administrators to cause a denial of service (host crash) and possibly execute arbitrary code or obtain sensitive information via an invalid guest frame number.","cvss_score":"7.2","exploit_count":"0","publish_date":"2016-09-21","update_date":"2016-09-22","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7154\/"},{"cve_id":"CVE-2016-7153","cwe_id":"200","summary":"The HTTP\/2 protocol does not consider the role of the TCP congestion window in providing information about content length, which makes it easier for remote attackers to obtain cleartext data by leveraging a web-browser configuration in which third-party cookies are sent, aka a &quot;HEIST&quot; attack.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-06","update_date":"2016-09-26","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7153\/"},{"cve_id":"CVE-2016-7152","cwe_id":"200","summary":"The HTTPS protocol does not consider the role of the TCP congestion window in providing information about content length, which makes it easier for remote attackers to obtain cleartext data by leveraging a web-browser configuration in which third-party cookies are sent, aka a &quot;HEIST&quot; attack.","cvss_score":"5.0","exploit_count":"0","publish_date":"2016-09-06","update_date":"2016-09-26","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7152\/"},{"cve_id":"CVE-2016-7143","cwe_id":"285","summary":"The m_authenticate function in modules\/m_sasl.c in Charybdis before 3.5.3 allows remote attackers to spoof certificate fingerprints and consequently log in as another user via a crafted AUTHENTICATE parameter.","cvss_score":"6.8","exploit_count":"0","publish_date":"2016-09-21","update_date":"2016-09-21","url":"http:\/\/www.cvedetails.com\/cve\/CVE-2016-7143\/"}]